app/controllers/questions_controller.rb

INSERT INTO "questions" ("quize", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["quize", "What are the seven wonders in the world?"], ["description", ""], ["created_at", "2016-05-05 11:18:30.964041"], ["updated_at", "2016-05-05 11:18:30.964041"]]
---
  def create
    @question = Question.new(question_params)

    respond_to do |format|
      if @question.save