app/controllers/users_controller.rb

UPDATE "users" SET "name" = ?, "role_id" = ?, "notes" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "User1"], ["role_id", 1], ["notes", ""], ["updated_at", "2016-05-05 11:40:59.891063"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)